www/prj/apollo.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga12d215">Apollo</a></li>
<li><a href="#org04f892a">Original Specs</a>
<ul>
<li><a href="#orgdf96312">Architecture</a></li>
<li><a href="#orge40e543">DSKY</a></li>
<li><a href="#org2880b99">Interpreter</a></li>
<li><a href="#orgc190f57">Input</a></li>
<li><a href="#org5be4006">Timers and Multitasking</a></li>
<li><a href="#org1a4cca3">INLINK</a></li>
<li><a href="#org6f30f50">Прерывания</a></li>
<li><a href="#org87279ae">Периферия и ввод-вывод</a></li>
<li><a href="#org88fa9a5">Use cases</a></li>
</ul>
</li>
<li><a href="#orgeff0ddd">Components</a>
<ul>
<li><a href="#org36bc72f">4-digits 7-segment indicator 5461AS-1</a>
<ul>
<li><a href="#orgcd977ad">pinout</a></li>
</ul>
</li>
<li><a href="#org31a7713">MAX7219 dot matrix module based MAX7118CNG</a>
<ul>
<li><a href="#org3ca4b37">pinout</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga12d215" class="outline-2">
<h2 id="orga12d215">Apollo</h2>
<div class="outline-text-2" id="text-orga12d215">
<p>
Функциональный хоббийный компьютер, построенный по принципам бортового
управляющего компьютера космической программы "Аполлон" - Apollo Guidance
Computer на базе микроконтроллера ATMEGA328, 7-сегментных индикаторов и
клавиатуры от калькулятора.
</p>
</div>
</div>

<div id="outline-container-org04f892a" class="outline-2">
<h2 id="org04f892a">Original Specs</h2>
<div class="outline-text-2" id="text-org04f892a">
</div>
<div id="outline-container-orgdf96312" class="outline-3">
<h3 id="orgdf96312">Architecture</h3>
<div class="outline-text-3" id="text-orgdf96312">
<p>
Хэлу Лейнингу (Hal Laning) сначала пришлось разбираться, как организовать
многочисленные функции ПО, чтобы они выполнялись практически одновременно
в реальном времени на бортовом компьютере космического аппарата, имеющем
ограниченные размер и быстродействие.
</p>

<p>
Архитектура Хэла позволила избежать подводных камней, свойственных
операционной системе, в которой вычисления должны быть четко разделены
между временными отрезками.
</p>

<p>
Лейнинг разработал систему, в которой программные функции распределяются
в виде «задач», которые могут быть любого размера, который потребуется
для выполнения этих функций. Каждой задаче назначается
приоритет. Операционная система всегда выполняет задачу с наибольшим
приоритетом. Если выполняется задача с низким приоритетом, и в это время
назначается задача с высоким приоритетом, то задача с низким приоритетом
будет приостановлена, пока не закончится задача с высоким приоритетом.
</p>

<p>
Executive (операционная система реального времени AGC и
LGC. прим. перев.) организовывала выполнение задач таким образом, что
каждая задача сохраняла своё состояние в виде набора регистров, и
состояние сохранялось, пока выполняется задача с большим приоритетом. LGC
содержит массив из восьми наборов по 12 регистров каждый, по 15 бит в
регистре. Набор регистров такого размера достаточен для выполнения
множества задач, но задачи, использующие интерпретатор (встроенный
интерпретирующий язык для задач, оперирующих с числами двойной
точности. прим. перев.) для выполнения векторных и матричных вычислений,
требуют больше места. Для таких задач выделяется отдельный массив из 43
регистров. LGC содержит пять таких массивов (Vector Accumulator, VAC).
</p>

<p>
Функции, выполняющиеся последовательно одна за другой, объединялись в
одну задачу. Большая задача SERVICER была активна в течение всей фазы
посадки и других фаз полёта с включенным двигателем, и она включала в
себя навигацию с использованием акселерометров, уравнения движения,
управление дроссельной заслонкой двигателя, вывод данных о положении
корабля, вывод других данных на дисплей, и каждая функция использовала
выходные данные предыдущих.
</p>

<p>
Количество доступных регистровых массивов и VAC ограничивает количество
задач, которые могут стоять в очереди на исполнение восемью, из которых
до пяти могут использовать массивы VAC. При нормальной работе, количество
запущенных задач остаётся постоянным, хотя задачи, запущенные для
однократного исполнения, или асинхронным образом, могут вызывать
флуктуации загрузки системы.
</p>

<p>
Однако, если количество запущенных задач больше, чем завершённых,
количество использованных регистровых массивов и VAC растёт. Если эта
ситуация продолжается достаточно долго, то их количество иссякает, и
запрос на запуск следующей задачи не может быть удовлетворён.
</p>

<p>
Вернёмся на год раньше, до запуска Аполлона 11, когда мы,
инженеры-программисты, думали, что у нас и так достаточно дел, и от нас
требуют написать ПО для посадки на Луну таким образом, что может быть в
буквальном смысле отключен и включен обратно без прерывания процесса
посадки и иных жизненно важных манёвров! Это называлось «защитой от
рестарта». Помимо помех по питанию, и другие факторы могут вызвать
рестарт системы. Рестарт происходит, если железо думает, что программа
зависла в бесконечном цикле, или если произошла ошибка чётности при
чтении ПЗУ, или ещё по нескольким другим причинам.
</p>

<p>
Защита от рестарта была реализована при помощи регистрации «путевых
точек» в подходящих точках программы, расставленных таким образом, что
возврат к последней «путевой точке» не вызывал ошибку, как показано в
следующем примере:
</p>

<p>
NEW<sub>X</sub> = X + 1
регистрация путевой точки
X = NEW<sub>X</sub>
</p>

<p>
Очевидно, что без регистрации путевой точки выполнение этого кода второй
раз вызовет повторный инкремент X.
</p>

<p>
После рестарта такая программа возобновляет свою работу. Каждая задача
начинает работу с последней зарегистрированной путевой точки. если
несколько копий одной и той же задачи находились в очереди,
возобновляется только последняя. Некоторые задачи не имеют статус
жизненно важных, и не защищены от рестарта. Они просто исчезают.
</p>

<p>
Защита от рестарта работала очень хорошо. На панели управления нашего
гибридного симулятора в Кембридже была кнопка, вызывающая рестарт
AGC. При тестировании ПО мы иногда нажимали эту кнопку в случайные
моменты времени, почти надеясь, что сбой приведёт нас к ещё одному
багу. Неизменно, каждый раз срабатывала защита от рестарта, и работа
продолжалась без остановки.
</p>

<p>
Не только железо могло вызвать рестарт, он мог быть вызван программно,
если программа достигала точки, в которой компьютер не знал, как
продолжить выполнение программы. Это происходило при передаче управления
по метке BAILOUT в модуле «Alarms and Aborts». Вызов сопровождался кодом
ошибки.
</p>

<p>
Эти действия выполнялись системой Executive, если ресурсы исчерпаны. Если
задача не может быть поставлена на выполнение из-за того, что нет
свободных массивов для сохранения регистров, Executive вызывал BAILOUT с
кодом ошибки 1202. Если не было свободного VAC, то вызывался BAILOUT с
кодом 1201.
</p>

<p>
Не все функции, выполняемые в LGC выполнялись как «задачи». Помимо них,
были аппаратные прерывания, которые могли возникнуть в любой момент (если
не были в явном виде запрещены), которые выполняли высокоприоритетные
функции, прерывания были назначены определённым устройствам, включая
цифровой автопилот, «uplink» и «downlink» (устройство приёма и передачи
данных по радиоканалу с Землёй. прим. перев.) и клавиатуре.
</p>

<p>
Другие прерывания могли быть использованы для выполнения кусков кода,
которые должны быть выполнены в определённое время. Такие функции
назывались «задания» (tasks), и их планирование происходило в
подпрограмме, называемой WAITLIST. «Задания» должны были иметь очень
маленькое время выполнения.
</p>

<p>
В то время, как «задачи» (jobs) планировались для выполнения с
определённым приоритетом, «задания» (tasks) планировались для запуска в
определённое время. Задания и задачи часто использовались
совместно. Задание могло быть запущено для считывания показаний датчика,
которые должны быть считаны в строго определённое время, и задание, в
свою очередь, запускало задачу с определённым приоритетом для обработки
этих показаний.
</p>
</div>
</div>
