org/prj/apollo.org
** DSKY

DSKY был главным человеко-машинным интерфейсом для LGC. Для дисплея,
который имел три регистра общего назначения, каждый из которых хранил
знаковое число длиной пять десятичных разрядов, три регистра по две
десятичных цифры для индикации текущей фазы полёта (числа от 63 до 68 для
посадки на Луну), а также «глагол» и «существительное». Глаголы и
существительные нужны для примитивного языка коммуникации между командой
и компьютером. Фаза полёта и комбинация глагол/существительное в
некоторых случаях задаются программой, а в других случаях вводятся с
клавиатуры с 19 клавишами. Содержание трёх регистров общего назначения
зависит от введённого существительного и глагола. DSKY также содержит
массив индикаторных лампочек, которые управляются компьютером, и
индикаторов активности компьютера, которые зажигаются, когда LGC не
находится в состоянии ожидания.

** Interpreter

Компьютер AGC в лунном модуле и в командном модуле программировался на
двух языках. Один, который мы называли «Basic», или более правильно
«Yul», был ассемблером, имеющим около 40 команд [6], за авторством Хью
Блэра-Смита (Hugh Blair-Smith). Вторым был интерпретатор,
интерпретирующий язык (по сути, набор подпрограмм), разработанный для
упрощения навигационных вычислений, включающих вектора и матрицы чисел
двойной точности (30-битные числа с фиксированной точкой), но очень
медленный. «The Interpreter» был написан Чарьзом Мюнтцом (Charles Muntz).

** Input

Стандартной процедурой ввода команды в DSKY является последовательность:
VERB-DIGIT-DIGIT, NOUN-DIGIT-DIGIT и ENTR. Это отражает идеологию
взаимодействия пользователя с AGC: вводится глагол (VERB), и номер
действия, которое нужно сделать, и существительное (NOUN), также
кодируемое номером, которое указывает объект, на который направлено
действие. Список кодов глаголов и существительных содержится в инструкции

Нажатие кнопки VERB на клавиатуре очищает индикатор VERB. Затем астронавт
вводит две цифры, которые интерпретируются как номер глагола, затем то же
самое делается с существительным (NOUN). До тех пор, пока кнопка ENTR не
нажата, коды можно исправить повторением ввода NOUN или VERB. После
нажатия ENTR каждые 1.5 секунды мигают цифры на индикаторах VERB и NOUN,
это означает, что оператор должен ввести данные, зависящие от
операции. После этого начинается выполнение операции.

Данные могут вводиться в восьмеричной и десятичной форме. Компьютер
считает, что если знак "+" или "-" не введён, то данные будут в
восьмеричной форме. Если при вводе восьмиричного числа нажать кнопки 8
или 9, будет мигать индикатор OPR ERR. Если нажаты клавиши "+" или "-",
то соответствующий знак появляется на дисплее, означая, что компьютер
готов к приёму десятичного числа. Если оператор ошибся, он может нажать
на клавишу CLR и повторить ввод. Нажатие на ENTR завершает ввод. Для
сброса сигнала OPR ERR и возврата в режим ввода используется кнопка RSET.

Кнопка RSET используется для гашения всех предупреждающих сигналов: TEMP,
GIMBAL LOCK, PROG, RESTART и TRACKER. Это может быть полезно для того,
чтобы выяснить, был ли предупреждающий сигнал кратковременным или
вызвавшая его ошибка присутствует в данный момент.

** Timers and Multitasking

- (T3) Wait list — инкремент каждые 10 мс., сдвинут относительно T4RUPT
  на 5 мс
- (T4) T4RUPT — инкремент каждые 10 мс.
- (T5) Автопилот — инкремент каждые 100 мс.
- (T6) часы высокого разрешения — инкремент каждые 1/1600 с = 0.625 мс.

Первый таймер, T3, нужен для работы переключателя задач (Wait list). Wait
list — это список из очень коротких задач, каждая из которых занимает
маленькое время, и может быть выполена непосредственно в обработчике
прерывания. Список содержит до семи задач, каждая из которых запускается
с определённым интервалом. Время выполнения задачи строго ограничено 4
мс. За это время компьютер успевает выполнить около 160 инструкций.

Таймер T4 запускает критические периодические задачи, имеющие интервал от
20 до 120 мс, включающие в себя обмен данными с DSKY, опрос
переключателей на панелях управления кораблём и другие задачи.

** INLINK

(канал передачи телеметрии)

Устройство INLINK обеспечивает двустороннюю связь с Землёй, и служит для
передачи телеметрической информации и приёма данных от центра управления
полётами. Астронавты могут вводить необходимые для полёта данные через
DSKY, но это процесс медленный и чреватый ошибками. Через регистр INLINK
данные могут вводиться с Земли напрямую в компьютер.

** Прерывания

- Startup - Стартовый адрес после подачи питания AGC
- T6RUPT - TIME6 достиг 0. Таймер используется автопилотом.
- T5RUPT - TIME5 достиг переполнения. Таймер используется автопилотом.
- T3RUPT - TIME3 достиг переполнения. Используется планировщиком задач WAITLIST.
- T4RUPT - TIME4 достиг переполнения. Опрос и и обновление индикации DSKY
- KEYRUPT1 - Нажате кнопки DSKY. Код нажатой клавиши с главного DSKY доступен в канале 15
- KEYRUPT2 - Нажате кнопки второго DSKY. Код клавиши навигационного DSKY доступен в канале 16 (только в командном модуле)
- UPRUPT - Данные в регистре INLINK. Используется для DSKY
- DOWNRUPT - Регистр Downlink содержит данные. Используется для телеметрии AGC
- RADARUPT - Данные в регистре RNRAD. Данные от радара сближения
- RUPT10 - LM P64

** Периферия и ввод-вывод

Периферийными устройствами AGC являются инерциальная платформа,
двигатели, радар, DSKY и переключатели на панели управления.

Для ввода и вывода служат так называемые каналы. Запись и чтение канала
происходит сходно с записью и чтением ячейки ОЗУ, но в отличте от ОЗУ,
большинство каналов однонаправлены. Также есть порты-счётчики, которые
служат для считывания положений осей IMU, радара и секстанта. Импульсы от
датчиков углов инкрементируют и декрементируют счётчики, которые затем
могут быть считаны AGC.

DSKY посылает коды клавиш длиной 5 бит. Нажатие кнопки на DSKY генерирует
прерывание KEYRUPT, код при этом помещается во входной канал.

Ещё один пример, когда необходима передача большого количества данных
через порт, это интерфейсы uplink и downlink, обеспечивающие связь с
Землёй на скорости 51 кбит/c или 1900 бит/с (выбирается вручную
экипажем).

