www/prj/apollo.html

<div id="outline-container-orge40e543" class="outline-3">
<h3 id="orge40e543">DSKY</h3>
<div class="outline-text-3" id="text-orge40e543">
<p>
DSKY был главным человеко-машинным интерфейсом для LGC. Для дисплея,
который имел три регистра общего назначения, каждый из которых хранил
знаковое число длиной пять десятичных разрядов, три регистра по две
десятичных цифры для индикации текущей фазы полёта (числа от 63 до 68 для
посадки на Луну), а также «глагол» и «существительное». Глаголы и
существительные нужны для примитивного языка коммуникации между командой
и компьютером. Фаза полёта и комбинация глагол/существительное в
некоторых случаях задаются программой, а в других случаях вводятся с
клавиатуры с 19 клавишами. Содержание трёх регистров общего назначения
зависит от введённого существительного и глагола. DSKY также содержит
массив индикаторных лампочек, которые управляются компьютером, и
индикаторов активности компьютера, которые зажигаются, когда LGC не
находится в состоянии ожидания.
</p>
</div>
</div>

<div id="outline-container-org2880b99" class="outline-3">
<h3 id="org2880b99">Interpreter</h3>
<div class="outline-text-3" id="text-org2880b99">
<p>
Компьютер AGC в лунном модуле и в командном модуле программировался на
двух языках. Один, который мы называли «Basic», или более правильно
«Yul», был ассемблером, имеющим около 40 команд [6], за авторством Хью
Блэра-Смита (Hugh Blair-Smith). Вторым был интерпретатор,
интерпретирующий язык (по сути, набор подпрограмм), разработанный для
упрощения навигационных вычислений, включающих вектора и матрицы чисел
двойной точности (30-битные числа с фиксированной точкой), но очень
медленный. «The Interpreter» был написан Чарьзом Мюнтцом (Charles Muntz).
</p>
</div>
</div>

<div id="outline-container-orgc190f57" class="outline-3">
<h3 id="orgc190f57">Input</h3>
<div class="outline-text-3" id="text-orgc190f57">
<p>
Стандартной процедурой ввода команды в DSKY является последовательность:
VERB-DIGIT-DIGIT, NOUN-DIGIT-DIGIT и ENTR. Это отражает идеологию
взаимодействия пользователя с AGC: вводится глагол (VERB), и номер
действия, которое нужно сделать, и существительное (NOUN), также
кодируемое номером, которое указывает объект, на который направлено
действие. Список кодов глаголов и существительных содержится в инструкции
</p>

<p>
Нажатие кнопки VERB на клавиатуре очищает индикатор VERB. Затем астронавт
вводит две цифры, которые интерпретируются как номер глагола, затем то же
самое делается с существительным (NOUN). До тех пор, пока кнопка ENTR не
нажата, коды можно исправить повторением ввода NOUN или VERB. После
нажатия ENTR каждые 1.5 секунды мигают цифры на индикаторах VERB и NOUN,
это означает, что оператор должен ввести данные, зависящие от
операции. После этого начинается выполнение операции.
</p>

<p>
Данные могут вводиться в восьмеричной и десятичной форме. Компьютер
считает, что если знак "+" или "-" не введён, то данные будут в
восьмеричной форме. Если при вводе восьмиричного числа нажать кнопки 8
или 9, будет мигать индикатор OPR ERR. Если нажаты клавиши "+" или "-",
то соответствующий знак появляется на дисплее, означая, что компьютер
готов к приёму десятичного числа. Если оператор ошибся, он может нажать
на клавишу CLR и повторить ввод. Нажатие на ENTR завершает ввод. Для
сброса сигнала OPR ERR и возврата в режим ввода используется кнопка RSET.
</p>

<p>
Кнопка RSET используется для гашения всех предупреждающих сигналов: TEMP,
GIMBAL LOCK, PROG, RESTART и TRACKER. Это может быть полезно для того,
чтобы выяснить, был ли предупреждающий сигнал кратковременным или
вызвавшая его ошибка присутствует в данный момент.
</p>
</div>
</div>

<div id="outline-container-org5be4006" class="outline-3">
<h3 id="org5be4006">Timers and Multitasking</h3>
<div class="outline-text-3" id="text-org5be4006">
<ul class="org-ul">
<li>(T3) Wait list — инкремент каждые 10 мс., сдвинут относительно T4RUPT
на 5 мс</li>
<li>(T4) T4RUPT — инкремент каждые 10 мс.</li>
<li>(T5) Автопилот — инкремент каждые 100 мс.</li>
<li>(T6) часы высокого разрешения — инкремент каждые 1/1600 с = 0.625 мс.</li>
</ul>

<p>
Первый таймер, T3, нужен для работы переключателя задач (Wait list). Wait
list — это список из очень коротких задач, каждая из которых занимает
маленькое время, и может быть выполена непосредственно в обработчике
прерывания. Список содержит до семи задач, каждая из которых запускается
с определённым интервалом. Время выполнения задачи строго ограничено 4
мс. За это время компьютер успевает выполнить около 160 инструкций.
</p>

<p>
Таймер T4 запускает критические периодические задачи, имеющие интервал от
20 до 120 мс, включающие в себя обмен данными с DSKY, опрос
переключателей на панелях управления кораблём и другие задачи.
</p>
</div>
</div>

<div id="outline-container-org1a4cca3" class="outline-3">
<h3 id="org1a4cca3">INLINK</h3>
<div class="outline-text-3" id="text-org1a4cca3">
<p>
(канал передачи телеметрии)
</p>

<p>
Устройство INLINK обеспечивает двустороннюю связь с Землёй, и служит для
передачи телеметрической информации и приёма данных от центра управления
полётами. Астронавты могут вводить необходимые для полёта данные через
DSKY, но это процесс медленный и чреватый ошибками. Через регистр INLINK
данные могут вводиться с Земли напрямую в компьютер.
</p>
</div>
</div>

<div id="outline-container-org6f30f50" class="outline-3">
<h3 id="org6f30f50">Прерывания</h3>
<div class="outline-text-3" id="text-org6f30f50">
<ul class="org-ul">
<li>Startup - Стартовый адрес после подачи питания AGC</li>
<li>T6RUPT - TIME6 достиг 0. Таймер используется автопилотом.</li>
<li>T5RUPT - TIME5 достиг переполнения. Таймер используется автопилотом.</li>
<li>T3RUPT - TIME3 достиг переполнения. Используется планировщиком задач WAITLIST.</li>
<li>T4RUPT - TIME4 достиг переполнения. Опрос и и обновление индикации DSKY</li>
<li>KEYRUPT1 - Нажате кнопки DSKY. Код нажатой клавиши с главного DSKY доступен в канале 15</li>
<li>KEYRUPT2 - Нажате кнопки второго DSKY. Код клавиши навигационного DSKY доступен в канале 16 (только в командном модуле)</li>
<li>UPRUPT - Данные в регистре INLINK. Используется для DSKY</li>
<li>DOWNRUPT - Регистр Downlink содержит данные. Используется для телеметрии AGC</li>
<li>RADARUPT - Данные в регистре RNRAD. Данные от радара сближения</li>
<li>RUPT10 - LM P64</li>
</ul>
</div>
</div>

<div id="outline-container-org87279ae" class="outline-3">
<h3 id="org87279ae">Периферия и ввод-вывод</h3>
<div class="outline-text-3" id="text-org87279ae">
<p>
Периферийными устройствами AGC являются инерциальная платформа,
двигатели, радар, DSKY и переключатели на панели управления.
</p>

<p>
Для ввода и вывода служат так называемые каналы. Запись и чтение канала
происходит сходно с записью и чтением ячейки ОЗУ, но в отличте от ОЗУ,
большинство каналов однонаправлены. Также есть порты-счётчики, которые
служат для считывания положений осей IMU, радара и секстанта. Импульсы от
датчиков углов инкрементируют и декрементируют счётчики, которые затем
могут быть считаны AGC.
</p>

<p>
DSKY посылает коды клавиш длиной 5 бит. Нажатие кнопки на DSKY генерирует
прерывание KEYRUPT, код при этом помещается во входной канал.
</p>

<p>
Ещё один пример, когда необходима передача большого количества данных
через порт, это интерфейсы uplink и downlink, обеспечивающие связь с
Землёй на скорости 51 кбит/c или 1900 бит/с (выбирается вручную
экипажем).
</p>
</div>
</div>
