www/prj/apollo.html

<div id="outline-container-org88fa9a5" class="outline-3">
<h3 id="org88fa9a5">Use cases</h3>
<div class="outline-text-3" id="text-org88fa9a5">
<p>
Более поздние миссии были организованы более гибко и первое зажигание DPS
проводилось на шаге P40 программы. (Более подробно программу полёта можно
посмотреть тут. прим. перев.) LM маневрирует в положение
поджига. Компьютер начинает обратный отсчёт до зажигания. На 30-й секунде
задача READACCS выполняется первый раз. Она читает показания
акселерометров в инерциальном модуле космического корабля, ставит на
исполнение задачу SERVICER, которая начинает выполняться немедленно, и
ставит на исполнение саму себя с задержкой в 2 секунды. Она
инициализируется вектором состояния от программы орбитальной интеграции,
и навигационные уравнения начинают использовать данные акселерометров для
вычисления положения и векторов ускорения. READACCS и SERVICER
запускаются каждые две секунды в течение всей фазы полёта с включенным
двигателем.
</p>

<p>
Команда набрала на компьютере «глагол 37», что означало фазу P63,
подготовку к управляемому снижению, и оставалась пока в командном модуле,
пока прожиг двигателя не завершён. Компьютер выполнял алгоритм,
рассчитывающий точное время зажигания, и положение, в котором должен быть
лунный модуль в этот момент. Далее космический корабль разворачивается в
нужное положение. В момент зажигания, сопло двигателя должно быть
направлено почти вперёд, против вектора орбитальной скорости корабля.
</p>

<p>
Управление передаётся программе BURNBABY — главная программа управления
зажиганием, которую мы написали после LM-1, чтобы сэкономить память путём
использования сходных алгоритмов в период, предшествующий зажиганию. На
DSKY высвечивается «Глагол 6, существительное 62». Средний регистр
содержит время в минутах и секундах, начинается обратный отсчёт до
зажигания. За 35 секунд дисплей гаснет, за 30 зажигается снова. Это
сигнал того, что стартовал алгоритм «Average-G». За 7,5 с начинается
«грязный» прожиг. За 5 секунд до старта дисплей мигает, ожидая стартовой
команды от экипажа. Баз Олдрин (Buzz Aldrin), пилот лунного модуля, стоит
справа от кокпита, на нём лежит главная ответственность по работе с
DSKY. Он нажимает «PROCEED».
</p>

<p>
В момент времени 102:33:05 от начала миссии самовоспламеняющееся топливо
поступает в двигатель посадки зажигается при дросселировании
10%. Армстронг не почувствовал даже лёгкого толчка — ускорение было
меньше 1/25g. Дисплей высветил «существительное 63» и три дисплея
регистров сейчас показывают полную скорость 5559.7 футов/с, и
вертикальную скорость -2.2 фута/с, высоту над поверхностью 49971 футов
[8].
</p>

<p>
Примерно через пять минут после зажигания Олдрин ввёл «глагол 16,
существительное 68» — запрос на отображение «существительного», при
котором третий регистр показывал разность между высотой, которую видит
радар, и вычисленной компьютером. Эта переменная, называемая DELTAH, была
около -2900 футов.
</p>

<p>
Затем мы услышали слова «программное предупреждение». В кембридже мы
переглянулись. На борту космического корабля, Олдрин увидел, как зажёгся
сигнал «PROG» и дисплей высветил снова «глагол 6, существительное 63». Он
быстро нажал «глагол 5 существительное 9». На дисплее DSKY появился код
предупреждения 1202. Это предупреждение появлялось, если компьютер
перегружен, т.е. запущено больше задач, чем на них хватит времени. В
Кэмбридже сказали: «предупреждение исполнения, нет места в памяти».
</p>

<p>
Между возникновением сигнала ошибки и ответом «продолжать» из Хьюстона
прошло полминуты. За это время центр управления полётом проверил величину
DELTAH, и Олдрин набрал «57», код, разрешающий системе навигации принять
данные радара. Затем он попробовал набрать «глагол 16, существительное
68» снова и увидел, как DELTAH уменьшилось до 900 футов.
</p>

<p>
Время миссии 102:41:32, корабль преодолел отметку 7400 футов, снижаясь со
скоростью 125 футов/с, «высокие ворота» были достигнуты. Навигационная
система сейчас должна выполнять другие задачи. Лунный модуль направлен
вперёд, так, что лунная поверхность видна по курсу. На DSKY регистр
режима показывал 64, что означало «фазу видимости», и «существительное
64» сменилось на «существительное 63». Вместо скорости в верхнем регистре
сейчас отображались два двузначных числа. Одно из них — обозначение точки
посадки (landing point designator, LPD), угол, который указывает, на
какую метку разметки на окне Армстронг должен смотреть, чтобы увидеть,
куда сядет корабль, если будет разрешена автоматическая посадка.
</p>

<p>
Время миссии 102:42:17, происходит ошибка 1201. Снова ошибка Executive
(Системное ПО компьютера состояло из двух подсистем: Executive — ОС
реального времени и The Interpreter — виртуальная машина, фактически
интерпретатор команд для работы с числами двойной точности. прим. перев.)
— нет свободной памяти. Через приблизительно 24 секунды снова
ошибка 1202. Центр управления в Хьюстоне говорит «продолжать» в обоих
случаях.
</p>
</div>
</div>
</div>
<div id="outline-container-orgeff0ddd" class="outline-2">
<h2 id="orgeff0ddd">Components</h2>
<div class="outline-text-2" id="text-orgeff0ddd">
</div>
<div id="outline-container-org36bc72f" class="outline-3">
<h3 id="org36bc72f">4-digits 7-segment indicator 5461AS-1</h3>
<div class="outline-text-3" id="text-org36bc72f">
</div>
<div id="outline-container-orgcd977ad" class="outline-4">
<h4 id="orgcd977ad">pinout</h4>
<div class="outline-text-4" id="text-orgcd977ad">
<p>
<a href="4dig7seg-pinout">4dig7seg-pinout</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org31a7713" class="outline-3">
<h3 id="org31a7713">MAX7219 dot matrix module based MAX7118CNG</h3>
<div class="outline-text-3" id="text-org31a7713">
</div>
<div id="outline-container-org3ca4b37" class="outline-4">
<h4 id="org3ca4b37">pinout</h4>
<div class="outline-text-4" id="text-org3ca4b37">
<p>
<a href="max7219-pinout">max7219-pinout</a>
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
